Revit 2027 API
BuiltInFailures.MechanicalFailures.PanelDoesntMatchCircuitProperties Property
 The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelDoesntMatchCircuitProperties { get; }
Public Shared ReadOnly Property PanelDoesntMatchCircuitProperties As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelDoesntMatchCircuitProperties {
	FailureDefinitionId^ get ();
}
static member PanelDoesntMatchCircuitProperties : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace